---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalService.ExternalService
source: html/b7643fe0-87e9-c4f4-e346-45b837ebb156.htm
---
# ExternalService Members

Registers a server with its service.